<h3> StockInfo DDL</h3>

In [14]:
import pandas
from glob import glob
import numpy
import jaydebeapi

In [15]:
from pandasql import sqldf
pysqldf=lambda q: sqldf(q,globals()) #建立函式，對q做sqldf(q,globals())的意思

In [16]:
data_folder = 'C:/Users/user/anaconda3/Projects/data/IBM-Stocks'

data_files = glob('%s/IBM-20??.csv' % data_folder) #用 % 指定位址

dataframe2017=pandas.read_csv(data_files[0])
dataframe2018=pandas.read_csv(data_files[1])
dataframe2019=pandas.read_csv(data_files[2])
dataframe2020=pandas.read_csv(data_files[3])
dataframe2021=pandas.read_csv(data_files[4])
df1=dataframe2017.append(dataframe2018)
df1=df1.append(dataframe2019)
df1=df1.append(dataframe2020)
df1=df1.append(dataframe2021)
df1

,Date,Open,High,Low,Close,Adj Close,Volume
0,2017-01-03,167.000000,167.869995,166.009995,167.190002,134.699081,2934300
1,2017-01-04,167.770004,169.869995,167.360001,169.259995,136.366806,3381400
2,2017-01-05,169.250000,169.389999,167.259995,168.699997,135.915649,2682300
3,2017-01-06,168.690002,169.919998,167.520004,169.529999,136.584320,2945500
4,2017-01-09,169.470001,169.800003,167.619995,167.649994,135.069672,3189900
...,...,...,...,...,...,...,...
176,2021-09-15,136.220001,137.800003,135.669998,137.199997,137.199997,3253900
177,2021-09-16,137.279999,137.949997,135.710007,136.429993,136.429993,2644000
178,2021-09-17,135.750000,135.919998,135.050003,135.229996,135.229996,5631300
179,2021-09-20,133.899994,135.179993,132.779999,134.309998,134.309998,4770700
180,2021-09-21,135.110001,135.639999,132.869995,132.970001,132.970001,4042768

In [17]:

dbConnection = jaydebeapi.connect(
    "org.h2.Driver",
    "jdbc:h2:C:/Users/user/anaconda3/Projects/data/H2",
    ["SA", ""],
    "C:/Java/h2/bin/h2-1.4.200.jar")
dbCursor = dbConnection.cursor()

In [18]:
_sql = [
    "INSERT INTO",
    "STOCKINFO(StockID, STOCKDATE,",
    "STOCKOPEN, STOCKHIGH, STOCKLOW,",
    "STOCKCLOSE, STOCKADJCLOSE, STOCKVOL, StockNet, StockScale)",
    "VALUES('%s', '%s', %f, %f, %f, %f, %f, %f, %f, %f);"
]

sql = ' '.join(_sql)

<h3> 清除</h3>

In [19]:
dbCursor.execute('TRUNCATE TABLE STOCKINFO;')

<h3> 新增欄位</h3>

In [23]:
df1['Net']=numpy.abs(df1['Adj Close']-df1['Open'])
df1['Scale']=numpy.abs(df1['High']-df1['Low'])

<h3> 篩選資料</h3>

In [24]:
my_SQL=' SELECT SUBSTR (Date,1,7) AS YM,df2 AS data FROM df1 GROUP BY SUBSTR(Date,1,7);' 
dbCursor.execute(my_SQL)

In [ ]:
my_SQL=[
    'SELECT * FROM df1 A',
    ' INNER JOIN',
    '(SELECT SUBSTR(Date,1,7) AS YM, MAX(StocklScale) AS Scale FROM df1 GROUP BY SUBSTR(Date,1,7)) B',
    'ON A.Net = B.Net'   
]
pysqldf(' '.join(my_SQL))
dbCursor.execute(insert_sql)

In [ ]:
my_SQL=[
    'SELECT * FROM df1 A',
    ' INNER JOIN',
    '(SELECT SUBSTR(Date,1,7) AS YM, MIN(StockNet) AS Net FROM df1 GROUP BY SUBSTR(Date,1,7)) B',
    'ON A.Net = B.Net'   
]
pysqldf(' '.join(my_SQL))
dbCursor.execute(insert_sql)

In [ ]:
my_monly_stats=(my_monthly['Volume'].mean())
my_SQL_statement=my_SQL % str(my_monly_stats[0])
my_SQL_statement